Tekla Open API Reference for Tekla Structures 2025
UserPropertyName Properties
The UserPropertyName type exposes the following members.
Properties
Name | Description
Name
 The user property item name.
Top
See Also
Reference
UserPropertyName Class
Tekla.Structures.Catalogs Namespace